[
    {
        "section": "Aquatique",
        "arrayPlants": [
            {"id0": "Le corail cerveau est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Il pousse au sol et par dessus les blocs de coraux. Il peut être détruit très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter le corail. Il ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon il meurt (et devient gris). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le sol des fonds des océans chauds."},
            {"id1": "Le corail bulles est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Il pousse au sol et par dessus les blocs de coraux. Il peut être détruit très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter le corail. Il ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon il meurt (et devient gris). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le sol des fonds des océans chauds."},
            {"id2": "La gorgone de corail cerveau est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Elle pousse au sol, en général sur les blocs de coraux. Elle peut être détruite très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter ces gorgones. Elle ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon elle meurt (et devient grise). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le fond des océans chauds."},
            {"id3": "La gorgone de corail bulles est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Elle pousse au sol, en général sur les blocs de coraux. Elle peut être détruite très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter ces gorgones. Elle ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon elle meurt (et devient grise). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le fond des océans chauds."},
            {"id4": "La gorgone de corail corné est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Elle pousse au sol, en général sur les blocs de coraux. Elle peut être détruite très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter ces gorgones. Elle ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon elle meurt (et devient grise). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le fond des océans chauds."},
            {"id5": "La gorgone de corail tubulaire est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Elle pousse au sol, en général sur les blocs de coraux. Elle peut être détruite très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter ces gorgones. Elle ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon elle meurt (et devient grise). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le fond des océans chauds."},
            {"id6": "Le corail de feu est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Il pousse au sol et par dessus les blocs de coraux. Il peut être détruit très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter le corail. Il ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon il meurt (et devient gris). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le sol des fonds des océans chauds."},
            {"id7": "Le corail corné est une plante (animal) que l'on trouve en grand nombre dans les océans chauds. Il pousse au sol et par dessus les blocs de coraux. Il peut être détruit très facilement à la main, mais il faudra utiliser un outil enchanté avec l'enchantement délicatesse si vous souhaitez récolter le corail. Il ne peut vivre que sous l'eau (ou a coté d'un bloc d'eau), sinon il meurt (et devient gris). La mort étant bien sur irréversible. Il est possible d'en faire pousser en utilisant de l'engrais sur le sol des fonds des océans chauds."},
            {"id8": "Le Varech est une espèce d'algue qui pousse au fond des océans de Minecraft, elle a un rôle principalement décoratif. La plante pousse en colonne, une colonne qui peut atteindre au maximum une hauteur de 35 blocs de haut (la pousse s'arrête au plus tard 2 blocs sous la surface de l'eau). Ce bloc est la tête de la plante : si on coupe la plante une nouvelle tête apparait à la nouvelle extrémité haute de la colonne d'algue et tous les blocs au-dessus de la coupe sont droppés en item de Varech. Il est possible de replanter de nouvelles colonnes en utilisant des Varech."},
            {"id9": "Le Varech est une espèce d'algue qui pousse au fond des océans de Minecraft, elle a un rôle principalement décoratif. La plante pousse en colonne, une colonne qui peut atteindre au maximum une hauteur de 35 blocs de haut (la pousse s'arrête au plus tard 2 blocs sous la surface de l'eau). Ce bloc est la tête de la plante : si on coupe la plante une nouvelle tête apparait à la nouvelle extrémité haute de la colonne d'algue et tous les blocs au-dessus de la coupe sont droppés en item de Varech. Il est possible de replanter de nouvelles colonnes en utilisant des Varech."},
            {"id10": "Les plantes aquatiques couvrent une partie des fonds océaniques. Elles peuvent être récoltées à l'aide de ciseaux. Il est possible d'en planter en déposant de l'engrais au fond de l'eau (au moins 2 blocs de hauteur d'eau, ces herbes peuvent pousser sur quasiment n'importe quel type de bloc)."},
            {"id11": "Ce bloc représente 4 cornichons de mer sur le même bloc. Il a exactement les mêmes propriétés que le cornichon de mer seul. Il est possible de l'obtenir en posant un cornichon de mer sur un bloc de 3 cornichons de mer. Lorsqu'on le détruit, il drop 4 cornichons de mer simultanément."},
            {"id12": "Les plantes hautes aquatiques couvrent une partie des fonds océaniques à côté des Herbes Aquatiques. Ces hautes herbes sont hautes de 2 blocs de hauteur. Elles peuvent être récoltées à l'aide de ciseaux. Il est possible d'en faire pousser en déposant de l'engrais sur une herbe aquatique (au moins 3 blocs de hauteur d'eau)."}
           
        ],
        "arrayAnimals": [
            {"id0": "Les bébés zombies ont 5 % de chances d'apparaître naturellement. Ils ressemblent aux zombies normaux, avec les spécificités suivantes : Comme ils sont plus petits, ils sont plus furtifs et difficilement repérables au loin. Ils se déplacent 30 % plus vite que les zombies ordinaires, mais ils ont les mêmes points de vie que les zombies normaux. Cela rend les bébés zombies plus dangereux que leurs homologues adultes. Les bruits qu'ils produisent sont plus aigus que les effets sonores de zombies normaux. Les bébés zombies-villageois se transformeront en bébés villageois s'ils sont soignés. Quand ils portent une armure, celle-ci rétrécit pour s'adapter à la taille de leur corps. Contrairement à toutes les autres créatures du jeu, ils resteront indéfiniment bébés et ne deviendront jamais des zombies « adultes ». Leur boîte de collision est réduite. Ils peuvent se faufiler dans les espaces de 1×1 bloc. Ils donnent 12 points d'expérience lorsqu'ils sont tués par le joueur au lieu de 5. Dans la version Bedrock, un bébé zombie a 15 % de chances de se mettre à chevaucher une créature lorsqu'il tente d'attaquer un villageois, un Vindicateur nommé \"Johnny\", un joueur ou un golem."},
            {"id1": "Les araignées chevauchées (en anglais : Spider Jockey) sont des créatures hostiles formées par la combinaison d'une araignée ou araignée venimeuse [Version Bedrock uniquement] et d'un squelette, vagabond, Wither squelette la chevauchant."},
            {"id2": "Le creeper est une créature verte, pratiquement silencieuse, insidieuse et kamikaze. Une fois qu'il s'est assez rapproché du joueur, le creeper laissera échapper un sifflement sonore et explosera après 1 à 2 secondes. Il est également possible d'activer l'explosion des creepers manuellement en utilisant un amorceur dessus. Les creepers sont silencieux quand ils ne bougent pas et ne prennent pas feu quand ils sont exposés à la lumière du soleil, contrairement aux zombies et aux squelettes. En revanche, ils n'apparaissent que dans les endroits sombres (dans les cavernes ou la nuit). Lorsqu'ils sont frappés par la foudre, les creepers se chargent et se transforment alors en Creeper Electrifié. Lorsqu'un creeper est tué par un squelette, il peut dropper des disques. Lorsqu'il est tué par un Creeper Electrifié, il drop une tête de creeper."},
            {"id3": "L'enderman est un monstre assez rare dans le monde normal. C'est un mob qui a la possibilité de prendre et de déplacer des blocs. Ils ne vous attaqueront pas sauf si vous les regardez directement dans les yeux, ils se téléporteront alors derrière vous et deviendront extrêmement hostiles. L'eau (et donc aussi la pluie) est leur ennemi, en effet au contact de celle-ci ils perdront de la vie, c'est pourquoi ils se téléportent instantanément à son contact. Les endermen sont omniprésents dans le monde The End. Comme pour la plupart des monstres, les endermans ne spawnent que dans les endroits sombres. Les endermans sont passifs, ils ne vous agresseront que si vous les attaquez ou si vous les regardez dans les yeux. En plaçant une citrouille sur votre tête, ils vous ignoreront même si vous les regardez."},
            {"id4": "Les noyés sont des monstres aquatiques que l'on trouve dans les océans et les rivières, principalement dans les zones de faible luminosité comme la nuit ou en profondeur. Contrairement aux autres mobs aquatiques, les noyés ne nagent pas ; ils marchent sur le fond de l'eau, bien qu'ils sachent nager si nécessaire. Certains noyés sont armés de tridents, une arme très puissante qu'ils peuvent lancer sur les joueurs. Ils font partie de la famille des zombies : ils leur ressemblent, et lorsqu'un zombie se noie, il se transforme en noyé après quelques secondes. Les zombies momifiés se noient également, mais se transforment d'abord en zombie, puis quelques secondes plus tard en noyé. Contrairement aux zombies villageois, les noyés ne se transforment pas. Les noyés peuvent apparaître avec des objets rares dans les mains, comme des tridents ou des coquillages. Il y a une faible chance qu'ils laissent tomber ces objets en mourant, ce qui en fait l'un des seuls moyens d'obtenir ces objets."},
            {"id5": "Les zombies villageois sont des créatures similaires aux zombies, mais leur apparence ressemble à celle des villageois. Ils peuvent apparaître naturellement ou résulter de la transformation d'un villageois infesté par un zombie. Lorsqu'un zombie attaque un bébé villageois, cela produit un bébé zombie villageois. Les zombies villageois peuvent être soignés pour redevenir des villageois. Pour ce faire, il faut utiliser une potion de faiblesse sur le zombie villageois, puis lui donner une pomme dorée en cliquant droit dessus. Le zombie commencera à trembler et redeviendra un villageois après quelques minutes. Depuis la version 1.10, il est possible de trouver des villages de zombies, où les zombies villageois apparaissent naturellement. Ces villages se distinguent par l'absence de portes et de torches."},
            {"id6": "Les slimes sont des cubes verts translucides. Ils peuvent apparaître sous trois tailles officielles : grande, moyenne et petite. On peut les trouver dans les zones éclairées et sombres, mais seulement dans les couches les plus profondes de la carte, à une profondeur inférieure à 40. Ils apparaissent généralement dans de grandes cavernes ou des mines à ciel ouvert, nécessitant un espace suffisamment grand pour apparaître. Lorsque vous tuez un slime de grande taille, 2 à 4 versions plus petites apparaissent."},
            {"id7": "La sorcière est un mob très rare mais aussi très puissant, apparu dans Minecraft pour Halloween en 2012 et toujours présent aujourd'hui. On les trouve généralement cachées dans des huttes, situées dans des biomes de marais. Il est également possible, bien que plus rare, d'en rencontrer dans n'importe quel biome la nuit. Les sorcières peuvent également apparaître lorsqu'un villageois est frappé par la foudre. Elles sont également visibles lors des raids d'attaques contre les villages, à partir de la 3ème vague. Durant ces attaques, elles peuvent lancer des potions de guérison ou de régénération pour aider les autres villageois qui attaquent avec elles."},
            {"id8": "Les araignées sont agressives pendant la nuit ou dans l'obscurité ; on les reconnaît à leurs yeux qui brillent en rouge. Elles sont rapides et capables de grimper aux murs. Lorsqu'elles poursuivent le joueur pendant la nuit, elles continueront à le chasser durant la journée. Les araignées sont neutres lorsqu'elles sont exposées aux rayons du soleil, ce qui signifie qu'elles n'attaqueront pas le joueur à moins d'être provoquées. Il peut arriver que des araignées apparaissent avec un squelette sur leur dos, on les appelle les Araignées Jockey."},
            {"id9": "Les squelettes sont des créatures hostiles. Ce sont des ennemis rapides qui tirent des flèches sur les joueurs, ce qui en fait un ennemi très dangereux. Comme les zombies, les squelettes n'apparaissent que dans les zones sombres telles que les lieux non éclairés à la surface pendant la nuit ou dans les cavernes. Au contact direct de la lumière du soleil, ils prennent feu et finissent par mourir de leurs brûlures. Il peut arriver que des araignées apparaissent avec un squelette sur leur dos ; on les appelle les Araignées Jockey. Lorsqu'un squelette est tué par un Creeper Électrifié, il droppe un crâne de squelette."},
            {"id10": "Les zombies sont des créatures simples : ils poursuivent le joueur et ne peuvent lui infliger des dégâts qu'en le touchant. Ils apparaissent souvent par groupes de 2 à 6 zombies. Ils n'apparaissent que dans les zones sombres (la nuit ou dans les cavernes) et ils brûlent sous le soleil s'ils ne sont pas protégés par un casque. Les zombies peuvent parfois avoir des objets à la main : pelles, pommes de terre, carottes, etc. Ils peuvent aussi parfois ramasser des objets abandonnés au sol. Dans tous les cas, s'ils meurent, ils dropperont l'objet qu'ils avaient à la main. Les zombies peuvent également avoir des bébés : ils sont très rares mais redoutables : plus rapides que les joueurs, il sera difficile de leur échapper. Les zombies poursuivent naturellement les villageois. S'ils en attrapent un, celui-ci se transformera en zombie villageois. Lorsqu'un zombie est tué par un Creeper Électrifié, il droppe une tête de zombie."},
            {"id11": "Les gardiens sont des monstres aquatiques qui protègent les monuments sous-marins. Pour cette raison, on ne les trouve qu'à proximité de ces monuments. Ils sont hostiles et attaquent aussi bien les joueurs que les autres créatures aquatiques (poulpes). Les gardiens attaquent à distance grâce à un rayon laser projeté contre leur cible. Le rayon doit rester fixe sur la cible pendant quelques instants pour que les dégâts soient infligés. Durant l'attaque, le gardien ne peut pas se déplacer. Pendant ses déplacements, il rentre ses piques dans sa tête, il n'est alors plus dangereux. Les gardiens suivent en permanence leur cible du regard, grâce à leur œil unique au centre de la tête, une particularité unique dans le jeu."},
            {"id12": "La morue est un poisson que l'on trouve couramment dans la plupart des biomes océaniques. Les morues vivent en petit groupe. Il est possible de ramasser ces poissons dans un seau en utilisant un seau d'eau, on obtient alors un seau d'eau avec une morue dedans. Ces poissons ont besoin d'eau pour vivre, hors de l'eau ils meurent en quelques secondes."},
            {"id13": "Le saumon est un poisson que l'on trouve couramment dans la plupart des biomes océan froid, ainsi que dans les rivières. Ils vivent en petit groupe. Les saumons sont capables de remonter les courants d'eau. Il est possible de ramasser ces poissons dans un seau en utilisant un seau d'eau, on obtient alors un seau d'eau avec un saumon dedans. Ces poissons ont besoin d'eau pour vivre, hors de l'eau ils meurent en quelques secondes."},
            {"id14": "Les poissons tropicaux se trouvent en grande quantité dans les biomes d'océans chauds (océans tièdes et océans chauds). Ils ont la particularité d'être disponibles dans une grande diversité de formes, motifs et couleurs : pas moins de 2700 variantes de ce poisson sont disponibles (2 x 15 couleurs + 6 motifs/nageoires + 2 tailles). Ils vivent en petit groupe. Il est possible de ramasser ces poissons dans un seau en utilisant un seau d'eau, on obtient alors un seau d'eau avec un poisson tropical dedans. Ces poissons ont besoin d'eau pour vivre, hors de l'eau ils meurent en quelques secondes."},
            {"id15": "La tortue est un animal que l'on trouve sur certaines plages et dans les océans. Elle vit seule ou en petit groupe jusqu'à 5 individus. La tortue se déplace lentement sur la terre, mais en contrepartie elle possède beaucoup de points de vie (15 cœurs). Dans l'eau en revanche, elle est beaucoup plus rapide. Les tortues se reproduisent en pondant des œufs. Si vous ne défendez pas ces œufs, ils seront attaqués par les zombies et les squelettes. À leur naissance, les bébés tortues sont tout petits et essaieront de rejoindre l'océan le plus proche s'ils ne sont pas attaqués par ces mêmes prédateurs. En grandissant, la tortue droppera une écaille de tortue. Il est possible d'accélérer la croissance des bébés tortues en leur donnant à manger des herbes aquatiques. Les tortues garderont en mémoire toute leur vie leur plage de naissance, et reviendront y pondre leur œuf, c'est pourquoi il peut être utile de déplacer les œufs de tortue pour choisir leur plage de naissance. Une présentation complète des tortues est disponible dans cet article."},
            {"id16": "Les poulpes sont les seules créatures aquatiques de Minecraft. Équipées de huit tentacules, elles sont passives. Elles peuvent être rencontrées dans de l'eau, peu importe sa profondeur ou son biome. Elles laissent des poches d'encre noire en mourant. Depuis la version Release 1.13, lorsqu'un poulpe est attaqué, il libère un nuage d'encre noire avant de s'enfuir."},
            {"id17": "Les dauphins sont des animaux passifs qu'on trouve très fréquemment dans la majorité des océans (tous sauf les océans glacés). On les trouve en général en groupe de plusieurs individus. Bien que non violents, s'ils sont attaqués, l'ensemble du groupe de dauphins va se défendre contre l'attaquant (un joueur ou un autre mob). Les dauphins sont joueurs : si un objet flotte dans l'eau, les dauphins vont l'attraper pour jouer avec. En navigant sur l'océan, on voit régulièrement des dauphins sauter hors de l'eau. Les dauphins sont même capables de sauter par-dessus une bordure pour rejoindre une autre étendue d'eau. Lorsqu'un joueur nage rapidement (sprint) près d'un dauphin, il bénéficie automatiquement de l'effet de la grâce du dauphin (de 5s) qui lui fait gagner de la vitesse. Les dauphins peuvent vous aider à trouver des trésors : donnez-leur du poisson cru et ils nageront en direction du trésor le plus proche. Si un dauphin se retrouve hors de l'eau, il finira par suffoquer au bout de quelques minutes. À l'inverse, ils doivent malgré tout respirer hors de l'eau, s'ils ne peuvent plus remonter à la surface pour respirer, ils finissent par mourir noyés."},
            {"id18": "La chauve-souris est un mob passif et inoffensif qu'on trouve naturellement dans les grottes obscures. Au repos, elle dort paisiblement, accrochée au plafond des grottes, la tête en bas. Lorsqu'un joueur s'approche, elle s'envole, mais reste inoffensive."}
        ]
    },
    {
        "section": "Artique",
        "arrayPlants": [
            {"id0": "desc"},
            {"id1": "desc"}
        ],
        "arrayAnimals": [
            {"id0": "desc"},
            {"id1": "desc"}
        ]
    },
    {
        "section": "Desertique",
        "arrayPlants": [
            {"id0": "desc"},
            {"id1": "desc"}
        ],
        "arrayAnimals": [
            {"id0": "desc"},
            {"id1": "desc"}
        ]
    },
    {
        "section": "Marecage",
        "arrayPlants": [
            {"id0": "desc"},
            {"id1": "desc"}
        ],
        "arrayAnimals": [
            {"id0": "desc"},
            {"id1": "desc"}
        ]
    }
]